[
    {
        "id": 0,
        "category": "English Tenses",
        "content": {
            "id": 0,
            "image": "timer",
            "description": "Времена в английском языке",
            "lessons": [
                {
                    "id": 0,
                    "title": "Present Simple",
                    "explanation": "Время Present Simple обозначает действие в настоящем в широком смысле слова. Оно употребляется для обозначения обычных, регулярно повторяющихся или постоянных действий, например, когда мы говорим о чьих-либо привычках, режиме дня, расписании и так далее, то есть Present Simple обозначает действия, которые происходят в настоящее время, но не привязаны именно к моменту речи.\n\nI live in London.\nЯ живу в Лондоне.\nThe meeting starts at 6 o'clock.\nСобрание начинается в шесть часов.\n\nАнглийский глагол во временной форме Present Simple почти всегда совпадает со своей начальной, то есть указанной в словаре, формой без частицы to. Лишь в 3-ем лице единственного числа к ней нужно прибавить окончание -s:\n\nI work – he works\n\nЕсли глагол оканчивается на -s, -ss, -sh, -ch, -x, -o, то к нему прибавляется окончание -es:\n\nI wish – he wishes\n\nК глаголам на -y с предшествующей согласной тоже прибавляется окончание -es, а -y заменяется на -i-:\n\nI try – he tries\n\nЕсли же глагол оканчивается на -y с предшествующей гласной, то -y сохраняется и добавляется только окончание -s:\n\nI play – he plays\n\nДля того, чтобы построить вопросительное предложение, перед подлежащим в Present Simple нужно поставить вспомогательный глагол do (или does в 3 л. ед. ч.):\n\nDo you like rock?\nТебе нравится рок?\nDoes he speak Spanish?\nОн говорит по-испански?\n\nВ отрицательных предложениях тоже используется вспомогательный глагол do/does, но не перед подлежащим, а перед глаголом. После него прибавляется отрицательная частица not. Do/does и not часто сокращаются до don’t и doesn’t соответственно:\n\nI do not like black tea.\nЯ не люблю черный чай.\nShe doesn't smoke.\nОна не курит.\n\nПримечание:\nВспомогательный глагол do/does может стоять и в утвердительных предложениях. Тогда предложение приобретает бoльшую экспрессивность, глагол оказывается эмоционально выделен:\n\nI do want to help you.\nЯ на самом деле хочу тебе помочь.\nJane does know how to cook.\nДжейн действительно знает, как готовить.\n\nВ таких предложениях вспомогательный глагол никогда не сокращается.\n\nСлучаи употребления Present Simple\n\nРегулярные, повторяющиеся действия:\n\nI often go to the park.\nЯ часто хожу в парк.\nThey play tennis every weekend.\nКаждые выходные они играют в теннис.\n\nДействие в настоящем в широком смысле слова (не обязательно в момент речи):\n\nJim studies French.\nДжим изучает французский.\nWe live in Boston.\nМы живем в Бостоне.\n\nОбщеизвестные факты:\n\nThe Earth is round.\nЗемля – круглая.\nThe Volga is the longest river in Europe.\nВолга – самая длинная река в Европе.\n\nПеречисление последовательности действий:\n\nWe analyse what our clients may need, develop a new product, produce a sample, improve it and sell it.\nМы анализируем, что может понадобиться нашим клиентам, разрабатываем новый продукт, изготавливаем образец, дорабатываем его и продаем.\n\nНекоторые случаи указания на будущее время (если имеется в виду некое расписание или план действий, а также в придаточных предложениях времени и условия):\n\nThe airplane takes off at 2.30 p.m.\nСамолет взлетает в 14:30.\nWhen you see a big green house, turn left.\nКогда вы увидите большой зеленый дом, поверните налево.\n\nНекоторые случаи указания на прошедшее время (в заголовках газет, при пересказе историй):\n\nI met Lenny last week. He comes to me and says, “Hello, mister!”\nНа прошлой неделе я встретил Ленни. Подходит ко мне и говорит: «Здравствуйте, мистер!»"
                },
                {
                "id": 1,
                "title": "Past Simple",
                "explanation": "Время Past Simple используется для обозначения действия, которое произошло в определенное время в прошлом и время совершения которого уже истекло.\nДля уточнения момента совершения действия в прошлом при использовании времени Past Simple обычно используются такие слова, как:\n\nfive days ago – пять дней назад\nlast year – в прошлом году\nyesterday – вчера\nin 1980 – в 1980 году\nи т.п.\n\nДля того, чтобы поставить английский глагол во время Past Simple, нужно использовать его «вторую форму». Для большинства глаголов она образуется прибавлением окончания -ed:\n\nexamine – examined\nenjoy – enjoyed\nclose – closed\n\nОднако есть также достаточно большая группа неправильных английских глаголов, которые образуют форму прошедшего времени не по общим правилам, для них форму прошедшего времени нужно просто запомнить.\n\nWe saw your dog two blocks from here.\nМы видели вашу собаку в двух кварталах отсюда.\n\nВ вопросительном предложении перед подлежащим нужно использовать вспомогательный глагол do в прошедшем времени – did, а после подлежащего поставить основной, значимый глагол в начальной форме:\n\nDid you wash your hands?\nТы помыл руки?\nDid they sign the contract?\nОни подписали контракт?\n\nВ отрицательных предложениях перед глаголом нужно поставить вспомогательный глагол did и отрицательную частицу not:\n\nWe did not find our car.\nМы не нашли свою машину.\nI did not understand this question.\nЯ не понял этот вопрос.\n\nСлучаи употребления Past Simple:\n\nУказание на простое действие в прошлом:\n\nI saw Jeremy in the bank.\nЯ видел Джереми в банке.\n\nРегулярные, повторяющиеся действия в прошлом:\n\nThe old man often visited me.\nСтарик часто меня навещал.\nI noticed this charming shop girl each time I went to buy something.\nЯ замечал эту очаровательную продавщицу каждый раз, когда шел за покупками.\n\nПеречисление последовательности действий в прошлом:\n\nI heard a strange sound, looked back, and saw a huge cat sitting on the table.\nЯ услышал странный звук, обернулся и увидел здоровенного кота, сидящего на столе."
                },
                {
                    "id": 2,
                    "title": "Future Simple",
                    "explanation": "Время Future Simple ссылается на действие, которое совершится в неопределенном или отдаленном будущем.\nПростое будущее время в английском языке обычно используется с обстоятельствами:\n\ntomorrow – завтра\nnext year – в следующем году\nin five years – через пять лет\nin 2095 – в 2095 году\nи т.п.\n\nДля того, чтобы поставить глагол во временную форму Future Simple, нужно использовать его начальную форму и вспомогательный глагол will. В устной речи will чаще всего сокращается до формы ‘ll, которая может использоваться во всех лицах.\n\nПримечание:\nРанее при употреблении будущего времени для первого лица (I, we) было принято использовать вспомогательный глагол shall:\n\nI shall write to you every day.\nЯ буду писать тебе каждый день.\n\nОднако, в современном английском, особенно в устной речи, will стал использоваться для всех лиц:\n\nI will go to Paris next summer.\nСледующим летом я поеду в Париж.\n\nГлагол shall в настоящее время используется довольно редко в качестве модального глагола в предложении что-то сделать или помочь:\n\nShall we dance?\nМожет, потанцуем?\n\nВ вопросительном предложении вспомогательный глагол will ставится перед подлежащим. Значимый глагол остается после подлежащего в своей начальной форме:\n\nWill we go to the beach?\nМы пойдем на пляж?\nWill your boss agree with our conditions?\nВаш босс согласится с нашими условиями?\n\nВ отрицательных предложениях за вспомогательным глаголом следует отрицательная частица not. Вместе они могут быть сокращены до формы won’t:\n\nI will not let you down.\nЯ вас не подведу.\nFred won’t agree to help us.\nФред не согласится нам помочь.\n\nСлучаи употребления Future Simple:\n\nУказание на простое действие в будущем:\n\nWe’ll return in 4 hours.\nМы вернемся через 4 часа.\nIt will not be easy to convince him.\nЕго будет нелегко убедить.\n\nПри перечислении последовательности действий в будущем:\n\nI cannot wait for my vacation. I will go to the river, swim and fish every day.\nНе могу дождаться своего отпуска. Буду каждый день ходить к речке, купаться и ловить рыбу."
                },
                {
                    "id": 3,
                    "title": "Present Continuous",
                    "explanation": "Время Present Continuous обычно указывает на процесс, длящийся непосредственно в момент речи. На это могут указывать контекст или такие слова, как:\n\nnow – сейчас\nat the moment – в текущий момент\nи т.п.\n\nДля того, чтобы поставить глагол в форму времени Present Continuous, требуется вспомогательный глагол to be в настоящем времени и причастие настоящего времени (Participle I) смыслового глагола.\nTo be в настоящем времени имеет три формы:\n\nam – 1 лицо, ед. ч. (I am shaving.)\nis – 3 лицо, ед. ч. (He is  reading.)\nare – 2 лицо ед. ч. и все формы мн. ч. (They are sleeping.)\n\nПримечание:\nЛичные местоимения и вспомогательный глагол часто сокращаются до I’m, he’s, she’s, it’s, we’re, you’re, they’re.\nПричастие настоящего времени (Participle I) можно получить, прибавив к начальной форме значимого глагола окончание -ing:\n\njump – jumping\nlive – living\n\nВ вопросительном предложении вспомогательный глагол выносится на место перед подлежащим, а значимый глагол остается после него:\n\nWhy are you laughing?\nПочему ты смеешься?\nAre you using this dictionary?Вы используете этот словарь?\n\nВ отрицательных предложениях за вспомогательным глаголом следует отрицательная частица not. Формы is и are при этом могут быть сокращены до isn’t и aren’t соответственно.\n\nShe is not standing.\nОна не стоит.\nRadio isn’t working.\nРадио не работает.\n\nСлучаи употребления Present Continuous\n\nУказание на процесс, происходящий непосредственно в момент разговора:\n\nThe doctor is conducting an operation now.\nВрач сейчас проводит операцию.\nJack is talking on the phone at the moment.\nВ настоящий момент Джек разговаривает по телефону.\n\nДействие, находящееся в процессе своего развития, но необязательно происходящее в момент разговора:\n\nAre you still working in London?\nТы все еще работаешь в Лондоне?\nChicago police are investigating the case.\nПолиция Чикаго расследует дело.\n\nОписание повторяющихся действий с использованием слов always, constantly, forever. Как правило это относится к характерным свойствам и поведению людей, часто с негативной окраской:\n\nWhy are you always interrupting people?\nПочему ты вечно перебиваешь людей?\nHe is constantly complaining about his brother.\nОн постоянно жалуется на своего брата.\n\nЗапланированное действие в будущем, часто с глаголами движения:\n\nWe are landing in Heathrow in 20 minutes.\nМы приземляемся в Хитроу через 20 минут.\nHe is speaking at the conference this evening.\nОн выступает на конференции этим вечером.\n\nПримечание:\nАнглийские глаголы, связанные с восприятием (notice, hear, see, feel ...), эмоциями (love, hate, like ...), процессами умственной деятельности (think, believe, understand ...), владением (have, possess ...) не используются во временах группы Continuous, потому что они сами по себе обозначают процесс. Вместо них используется время Present Simple:\n\nI hear you, don’t shout.\nЯ слышу тебя, не кричи.\nI love pancakes.\nЯ люблю блинчики."
                },
                {
                    "id": 4,
                    "title": "Past Continuous",
                    "explanation": "Время Past Continuous указывает на процесс, длившийся в определенный момент или период в прошлом. В отличие от времени Past Simple, этот момент в прошлом должен быть назван прямо (например, yesterday at 5 o’clock, when you called, when rain started) или быть очевидным из контекста.\n\nWhen you called I was taking a shower.\nКогда ты позвонил, я принимал душ.\nCharlie and me were already driving home when the engine suddenly stopped.\nМы с Чарли уже ехали домой, как вдруг заглох мотор.\n\nДля того, чтобы поставить глагол в форму Past Continuous, нужен вспомогательный глагол to be в прошедшем времени и причастие настоящего времени (Participle I) смыслового глагола.\nTo be в прошедшем времени имеет две формы:\n\nwas – 1 и 3 лицо ед. ч. (I was smoking. He was eating.)\nwere – 2 лицо ед. ч. и все формы мн. ч. (They were laughing.)\n\nВ вопросительном предложении вспомогательный глагол выносится на место перед подлежащим, а значимый глагол остается после него:\n\nWere you sleeping when I called? You sounded drowsy.\nТы спал, когда я позвонил? Ты казался сонным.\n\nВ отрицательных предложениях за вспомогательным глаголом следует отрицательная частица not. Формы was и were при этом могут быть сокращены до wasn’t и weren’t соответственно.\n\nWe were not playing chess when you called.\nМы не играли в шахматы, когда ты позвонил.\nIn the morning our elevator wasn’t working.\nУтром наш лифт не работал.\n\nСлучаи употребления Past Continuous\n\nУказание на процесс, происходивший в конкретный момент времени в прошлом:\n\nI was sleeping when someone knocked at the door.\nЯ спал, когда кто-то постучал в дверь."
                },
                {
                    "id": 5,
                    "title": "Future Continuous",
                    "explanation": "Время Future Continuous указывает на процесс, который будет длиться в определенный момент в будущем. В отличие от времени Future Simple, этот момент в будущем должен быть назван прямо (tomorrow at 4 o’clock, when we meet) или быть очевидным из контекста.\n\nTomorrow this time I will be flying to New York.\nЗавтра в это же время я буду лететь в Нью-Йорк.\nDon’t disturb me in the evening, I’ll be preparing for exam.\nНе мешайте мне вечером, я буду готовиться к экзамену.\n\nДля того, чтобы поставить глагол в форму Future Continuous, нужен вспомогательный глагол to be в будущем времени и причастие настоящего времени (Participle I) смыслового глагола. To be в будущем времени имеет форму will be.\n\nThey will be packing presents tomorrow morning.\nЗавтра утром они будут упаковывать подарки.\n\nПримечание:\nЛичные местоимения и вспомогательный глагол часто сокращаются до I’ll, he’ll, they’ll и т.д. \n\nВ вопросительном предложении will выносится на место перед подлежащим, а to be и смысловой глагол остаются после него:\n\nWhy did you bring an album? Will we be studying painting?\nЗачем Вы принесли альбом? Мы будем изучать живопись?\n\nВ отрицательных предложениях после will ставится отрицательная частица not. Вместе они могут быть сокращены до формы won’t:\n\nAt 6 I won’t be sleeping yet.\nВ шесть я еще не буду спать.\n\nСлучаи употребления Future Continuous\n\nУказание на процесс, который будет происходить в определенный момент в будущем:\n\nAt 7 o’clock we’ll be having barbecue, you are welcome to join.\nВ семь часов у нас будет барбекю, приглашаем зайти."
                },
                {
                    "id": 6,
                    "title": "Present Perfect",
                    "explanation": "Время Present Perfect обозначает действие, которое завершилось к настоящему моменту или завершено в период настоящего времени.\n\nI have already done my homework.\nЯ уже сделал домашнее задание.\nWe have no classes today, our teacher has fallen ill.\nУ нас сегодня не будет уроков, наш учитель заболел.\n\nВремя Present Perfect образуется при помощи вспомогательного глагола to have в настоящем времени и причастия прошедшего времени значимого глагола, то есть его «третьей формы».\nTo have в настоящем времени имеет две формы:\n\nhas – 3 лицо, ед. ч. (He has played)\nhave – 1 и 2 лицо ед.ч. и все формы мн. ч. (I have played)\n\nПримечание:\nЛичные местоимения и вспомогательный глагол часто сокращаются до he’s, they’ve и т.п. В зависимости от использованного в предложении времени сокращения типа he’s могут расшифровываться и как he is, и как he has.\n\nПричастие второе, или причастие прошедшего времени (Participle II), можно получить, прибавив к начальной форме значимого глагола окончание -ed:\n\nexamine – examined\nenjoy – enjoyed\nclose – closed\n\nОднако есть также достаточно большая группа неправильных английских глаголов, которые образуют форму прошедшего времени не по общим правилам. Для них форму причастия прошедшего времени нужно запомнить.\n\nВ вопросительном предложении вспомогательный глагол выносится на место перед подлежащим, а значимый глагол остается после него:\n\nHave you seen this film?\nТы смотрел этот фильм?\nHas she come yet?\nОна еще не пришла?\n\nВ отрицательных предложениях за вспомогательным глаголом следует отрицательная частица not. Формы have и has при этом могут быть сокращены до haven’t и hasn’t соответственно:\n\nI haven’t seen him since then.\nС тех пор я его так и не видел.\n\nСлучаи употребления Present Perfect:\n\nЕсли говорящему важен сам факт произошедшего действия, а не его время или обстоятельства:\n\nI have been to Paris.\nЯ был в Париже.\nPeople have walked on the moon.\nЛюди ходили по луне.\n\nДля обозначения действий, которые начались в прошлом и продолжаются до текущего момента:\n\nI’ve studied Spanish since childhood.\nЯ учил испанский с детства.\nI haven’t seen my hometown for 45 years.\nЯ не видел свой родной город 45 лет."
                },
                {
                    "id": 7,
                    "title": "Past Perfect",
                    "explanation": "Время Past Perfect обозначает действие, которое завершилось до определенного момента в прошлом:\n\nI called Jim too late, he had already left.\nЯ позвонил Джиму слишком поздно, он уже ушел.\nWe had lived in Paris for 12 years before we moved to America.\nДо переезда в Америку мы прожили в Париже 12 лет.\n\nВремя Past Perfect образуется при помощи вспомогательного глагола to have в прошедшем времени и причастия прошедшего времени значимого глагола, то есть его «третьей формы».\nTo have в прошедшем времени имеет единственную форму had.\n\nПричастие второе, или причастие прошедшего времени (Participle II), можно получить, прибавив к начальной форме значимого глагола окончание -ed:\n\nexamine – examined\nenjoy – enjoyed\nclose – closed\n\nОднако в английском языке есть также достаточно большая группа неправильных глаголов, которые образуют форму прошедшего времени не по общим правилам.\n\nВ вопросительном предложении вспомогательный глагол выносится на место перед подлежащим, а значимый глагол остается после него:\n\nHad you brushed your teeth before you went to bed?\nТы почистил зубы, прежде чем пойти спать?\n\nВ отрицательных предложениях за вспомогательным глаголом следует отрицательная частица not. При этом они могут быть сокращены до формы hadn’t.\n\nI had not finished my work when he came here.\nЯ не закончил свою работу, когда он сюда пришел.\nHow did you hope to pass the exam if you hadn’t even opened the textbook?\nКак ты надеялся сдать экзамен, если ты до этого даже учебник не открыл?\n\nСлучаи употребления Past Perfect:\n\nДействие, закончившееся до определенного момента в прошлом, на которое может указывать точная дата или час, начало другого действия или контекст:\n\nAfter the Sun had set, we saw thousands of fireflies.\nПосле того, как зашло солнце, мы увидели тысячи светлячков.\n\nПеречисление действий в прошлом, произошедших до времени повествования в целом:\n\nI finally caught Lucky and looked around. The dog had scratched the furniture, had torn the wallpapers and had eaten my lunch on the table.\nЯ наконец поймал Лаки и осмотрелся вокруг. Cобака исцарапала мебель, порвала обои и съела мой обед на столе."
                },
                {
                    "id": 8,
                    "title": "Future Perfect",
                    "explanation": "Время Future Perfect используется довольно редко, оно обозначает действие, которое закончится до определенного момента или начала другого действия в будущем или будет продолжать длиться после него.\n\nNext year we will have been married for 30 years.\nВ следующем году мы будем женаты уже 30 лет.\n\nВремя Future Perfect образуется при помощи вспомогательного глагола to have в будущем времени и причастия прошедшего времени значимого глагола, то есть его «третьей формы».\nTo have в будущем времени имеет форму will have.\n\nThey will have covered 30 km by sunset.\nК закату они пройдут 30 км.\n\nПричастие второе, или причастие прошедшего времени (Participle II), можно получить, прибавив к начальной форме значимого глагола окончание -ed:\n\nexamine – examined\nenjoy – enjoyed\nclose – closed\n\nОднако в английском языке есть достаточно большая группа неправильных глаголов, которые образуют форму прошедшего времени не по общим правилам и которые необходимо запомнить.\n\nВ вопросительном предложении вспомогательный глагол выносится на место перед подлежащим, а значимый глагол остается после него:\n\nWill you have read all these books by the exam time?\nТы прочтешь все эти книги до начала экзаменов?\n\nВ отрицательных предложениях за вспомогательным глаголом следует отрицательная частица not. При этом они могут быть сокращены до формы won’t:\n\nI guess, I won't have received your next letter before Christmas.\nДумаю, я не получу твое следующее письмо раньше Рождества.\n\nСлучаи употребления Future Perfect:\n\nДействие, которое начнется и закончится до определенного момента в будущем:\n\nYou will have spent much efforts before you can run a marathon.\nТы потратишь много усилий, прежде чем сможешь пробежать марафон."
                },
                {
                    "id": 9,
                    "title": "Present Perfect Continuous",
                    "explanation": "Время Present Perfect Continuous указывает на действие, которое началось в прошлом, продолжалось в течение некоторого времени и либо закончилось непосредственно перед разговором или все еще продолжается в момент разговора.\n\nI have been waiting here for 2 hours!\nЯ прождал здесь два часа!\nWe have been preparing for our exam since morning.\nМы готовились к экзамену с самого утра.\n\nДля того, чтобы поставить глагол в форму времени Present Perfect Continuous, требуется вспомогательный глагол to be во времени Present Perfect и причастие настоящего времени (форма V-ing) смыслового глагола.\nTo be во времени Present Perfect имеет две формы:\n\nHave been – 1 и 2 лицо ед. ч. и все формы мн. ч.\nHas been – 3 лицо ед. ч.\n\nПричастие настоящего времени (Participle I) можно получить, прибавив к начальной форме значимого глагола окончание -ing:\n\njump – jumping\nlive – living\n\nВ вопросительном предложении вспомогательный глагол to have выносится на место перед подлежащим, а остальная часть сказуемого располагается после него:\n\nI smell tobacco. Have you been smoking?\nЯ чувствую запах табака. Ты что, курил?\nHas she been using my car again?\nОна опять пользовалась моей машиной?\n\nВ отрицательных предложениях за вспомогательным глаголом to have следует отрицательная частица not:\n\nIt has not been snowing here since 1993.\nЗдесь не было снега с 1993 года.\n\nСлучаи употребления Present Perfect Continuous:\n\nДействие, которое началось в прошлом, продолжалось в течение некоторого времени и все еще продолжается в момент разговора:\n\nThe workers have been trying to move our wardrobe for half an hour, go help them.\nРабочие вот уже полчаса пытаются сдвинуть наш шкаф с места, помоги им.\n\nДействие, которое началось в прошлом, продолжалось в течение некоторого времени и закончилось непосредственно перед разговором:\n\nDo you like this cake? I have been baking it since morning.\nТебе нравится этот пирог? Я пекла его с самого утра."
                },
                {
                    "id": 10,
                    "title": "Past Perfect Continuous",
                    "explanation": "Время Past Perfect Continuous указывает на действие, которое началось в прошлом, продолжалось в течение некоторого времени и либо закончилось непосредственно перед неким моментом в прошлом или все еще не закончилось к некоему моменту в прошлом.\n\nI had been typing this text for 2 hours and then found it on the Internet.\nЯ набирал этот текст два часа, а потом нашел его в Интернете.\nI had been waiting for his airplane for 2 hours when it was announced about delay.\nЯ ждал его самолет уже два часа, когда объявили о его задержке.\n\nДля того, чтобы поставить глагол в форму времени Past Perfect Continuous, требуется вспомогательный глагол to be во времени Past Perfect и причастие настоящего времени (форма V-ing) смыслового глагола. To be во времени Past Perfect имеет единственную форму had been.\n\nПричастие настоящего времени (Participle I) можно получить, прибавив к начальной форме значимого глагола окончание -ing:\n\njump – jumping\nlive – living\n\nВ вопросительном предложении вспомогательный глагол had выносится на место перед подлежащим, а остальная часть сказуемого располагается после него:\n\nI saw many puddles. Had it been raining?\nЯ видел много луж. Шел дождь?\n\nВ отрицательных предложениях за вспомогательным глаголом had следует отрицательная частица not:\n\nOf course he did not want to sleep! He had not been working like a horse all the week.\nРазумеется, ему не хотелось спать! Он-то не работал как вол всю неделю.\n\nСлучаи употребления Past Perfect Continuous:\n\nДействие, которое началось в прошлом, продолжалось в течение некоторого времени и закончилось непосредственно перед определенным моментом в прошлом:\n\nWe had been working hard and managed to finish the project in time.\nМы упорно работали и смогли завершить проект вовремя.\n\nДействие, которое началось в прошлом, продолжалось в течение некоторого времени и все еще продолжалось в определенный момент в прошлом:\n\nHer voice started to tremble. I did not realize what a hard time she had been having.\nЕе голос задрожал. Я и не представлял, как тяжело ей приходилось."
                },
                {
                    "id": 11,
                    "title": "Future Perfect Continuous",
                    "explanation": "Время Future Perfect Continuous указывает на действие, которое началось и продолжалось в течение некоторого времени до определенного момента в будущем. Это время используется очень редко, а в устной речи – практически никогда.\n\nNext month we will have been living together for 25 years.\nВ следующем месяце исполнится 25 лет, как мы живем вместе.\n\nДля того чтобы поставить глагол в форму времени Future Perfect Continuous, требуется вспомогательный глагол to be во времени Future Perfect и причастие настоящего времени (форма V-ing) смыслового глагола.\nTo be во времени Future Perfect имеет форму will have been.\n\nПричастие настоящего времени (Participle I) можно получить, прибавив к начальной форме значимого глагола окончание -ing:\n\njump – jumping\nlive – living\n\nВ вопросительном предложении вспомогательный глагол will выносится на место перед подлежащим, а остальная часть сказуемого располагается после него:\n\nI heard, you are going to retire next month? For how many years will you have been working here by that time?\nЯ слышал, в следующем месяце вы выходите на пенсию? Сколько к тому времени вы уже здесь будете работать?\n\nВ отрицательных предложениях за вспомогательным глаголом will следует отрицательная частица not:\n\nBy 2015 you will not have been living in this country long enough to participate in the election.\nК 2015 году вы не будете жить в этой стране достаточно долго, чтобы принять участие в выборах.\n\nСлучаи употребления Future Perfect Continuous:\n\nДействие, которое началось и продолжалось в течение некоторого времени до определенного момента в будущем:\n\nNext March we will have been living in Bulgaria for 2 years.\nВ марте исполнится два года с тех пор, как мы живем в Болгарии."
                },
                {
                "id": 12,
                "title": "Future in the Past",
                "explanation": "В английском языке существует еще четыре видовременные формы, связанные с будущим временем.Они ссылаются на будущее с точки зрения некоего момента в прошлом:\n\nWe wondered if the train would arrive in time.\nМы подумали, прибудет ли поезд вовремя.\n\nВремена Future in the Past употребляются в придаточных предложениях после слов said (that), told (that), thought (that) и т.п.\n\nРазличают следующие времена Future in the Past:\n\nSimple Future in the Past\nОбозначает действия в будущем, воспринимаемом из прошлого:\n\nHe said he would go to the dentist.\nОн сказал, что пойдет к зубному.\n\nContinuous Future in the Past\nОбозначает процесс, который будет длиться в определенный момент будущего, воспринимаемого из прошлого:\n\nThey said he would be working the whole day.\nОни сказали, что он будет работать весь день.\n\nPerfect Future in the Past\nДействие, которое будет закончено к определенному моменту будущего, воспринимаемого из прошлого:\n\nWe hoped we should have done our homework by midday.\nМы надеялись, что сделаем домашнее задание к полудню.\n\nPerfect Continuous Future in the Past\nЧрезвычайно редкое даже в письменной речи время, которое обозначает процесс, который начнется и будет продолжаться до определенного момента в будущем, воспринимаемом из прошлого:\n\nHe told us he would have been working on the plant for 30 years next December.\nОн рассказал нам, что в декабре исполнится 30 лет, как он работает на этом заводе."
            }
            ]
        },
        "test": {
            "id": 0,
            "questions": [
                {
                    "id": 0,
                    "content": "Jerry promised to come to work in time. He is not here, and he even ___.",
                    "correctIndex": 0,
                    "answers": [
                        "hasn't called",
                        "isn't calling",
                        "doesn't call"
                    ]
                },
                {
                    "id": 1,
                    "content": "___ you ever ___ to New York?",
                    "correctIndex": 2,
                    "answers": [
                        "Has/been",
                        "Were/-",
                        "Have/been"
                    ]
                },
                {
                    "id": 2,
                    "content": "I ___ pizza when you arrived.",
                    "correctIndex": 2,
                    "answers": [
                        "ate",
                        "am eating",
                        "was eating"
                    ]
                },
                {
                    "id": 3,
                    "content": "His train ___ at 11:45.",
                    "correctIndex": 1,
                    "answers": [
                        "arriving",
                        "arrives",
                        "arrive"
                    ]
                },
                {
                    "id": 4,
                    "content": "They won't ___ all the problems by the end of the meeting, I am afraid.",
                    "correctIndex": 0,
                    "answers": [
                        "have settled",
                        "be settling",
                        "settle"
                    ]
                },
                {
                    "id": 5,
                    "content": "He said, he ___ to the dentist.",
                    "correctIndex": 2,
                    "answers": [
                        "will go",
                        "goes",
                        "would go"
                    ]
                },
                {
                    "id": 6,
                    "content": "They ___ their sister before she went to Paris.",
                    "correctIndex": 1,
                    "answers": [
                        "will visit",
                        "had visited",
                        "visited"
                    ]
                },
                {
                    "id": 7,
                    "content": "___ you ___ English tomorrow at 3 o'clock?",
                    "correctIndex": 2,
                    "answers": [
                        "Do/learn",
                        "Will/learn",
                        "Will/be learning"
                    ]
                },
                {
                    "id": 8,
                    "content": "She has been sleeping since noon. Should we wake her up?",
                    "correctIndex": 0,
                    "answers": [
                        "has been sleeping",
                        "sleeps",
                        "is sleeping"
                    ]
                },
                {
                    "id": 9,
                    "content": "Jake is a good footballer. Do you know since when ___ football?",
                    "correctIndex": 2,
                    "answers": [
                        "is he playing",
                        "has he been playing",
                        "he has been playing"
                    ]
                },
                {
                    "id": 10,
                    "content": "I ___ English for seven years now.",
                    "correctIndex": 1,
                    "answers": [
                        "was learning",
                        "have been learning",
                        "am learning"
                    ]
                },
                {
                    "id": 11,
                    "content": "The boys ___ chess when their mother came home.",
                    "correctIndex": 0,
                    "answers": [
                        "were playing",
                        "played",
                        "will be playing"
                    ]
                },
                {
                    "id": 12,
                    "content": "I will be back soon. I hope you will ___ your translation by the time I come.",
                    "correctIndex": 1,
                    "answers": [
                        "have been finishing",
                        "have finished",
                        "be finishing"
                    ]
                },
                {
                    "id": 13,
                    "content": "By the first of December this year I will ___ here for fifteen years already.",
                    "correctIndex": 2,
                    "answers": [
                        "have worked",
                        "be working",
                        "have been working"
                    ]
                },
                {
                    "id": 14,
                    "content": "While I ___ the dishes last night, I dropped a plate and broke it.",
                    "correctIndex": 0,
                    "answers": [
                        "was washing",
                        "had been washing",
                        "had washed"
                    ]
                }
            ]
        }
    },
    {
        "id": 1,
        "category": "Passive voice",
        "content": {
            "id": 0,
            "image": "monitor",
            "description": "Пассивный залог в английском языке",
            "lessons": [
                {
                    "id": 0,
                    "title": "Passive voice",
                    "explanation": "Форма залога показывает, является ли подлежащее в предложении (лицо или предмет) производителем или объектом действия, выраженного сказуемым.\nПассивный залог (passive voice) показывает, что лицо или предмет, выраженное подлежащим, испытывает действие на себе:\n\nThe big cake was baked by Sam.\nБольшой пирог был испечен Сэмом.\n\nПассивный залог употребляется, когда исполнитель действия очевиден или несуществен, или когда действие или его результат более интересны, чем исполнитель.\n\nОбразование пассивного залога\nДля того, чтобы получить форму глагола в пассивном залоге, необходим вспомогательный глагол to be в соответствующем времени, лице и числе и причастие прошедшего времени (Participle II) значимого глагола:\n\nThis building will be demolished next month.\nЭто здание будет снесено в следующем месяце.\nMy dog has been stolen.\nМою собаку украли.\n\nВ отрицательных предложениях частица not ставится после вспомогательного глагола, а если их несколько, то после первого из них:\n\nHe has not been seen anywhere.\nЕго нигде не видели.\n\nВ вопросительных предложениях вспомогательный глагол (или первый из них) выносится на место перед подлежащим:\n\nWas your wallet stolen?\nВаш бумажник был украден?\n\nПассивный залог не может быть использован во временах группы Perfect Continuous и времени Future Continuous.\n\nЗначение и употребление времен глагола в пассивном залоге такое же, как и времен глагола в активном залоге.\n\nВ английском языке в пассивном залоге употребляются переходные глаголы, а также некоторые непереходные глаголы. Примеры предложений с переходными глаголами в пассивном залоге:\n\nBy the middle of the nineteenth century about sixty different elements had been discovered.\nК середине XIX столетия было обнаружено около 60 различных элементов.\nThe delegates will be met at the station.\nДелегатов встретят на вокзале.\nWhile a current is flowing through a wire, the latter is being heated.\nКогда ток проходит по проволоке, последняя нагревается."
                }
            ]
        },
        "test": {
            "id": 0,
            "questions": [
                {
                    "id": 0,
                    "content": "Not much ___ about the accident since that time.",
                    "correctIndex": 2,
                    "answers": [
                        "said",
                        "has said",
                        "has been said"
                    ]
                },
                {
                    "id": 1,
                    "content": "A cinema is a place where films ___.",
                    "correctIndex": 0,
                    "answers": [
                        "are shown",
                        "show",
                        "have been shown"
                    ]
                },
                {
                    "id": 2,
                    "content": "While we were on holiday, our camera ___ from our hotel room.",
                    "correctIndex": 2,
                    "answers": [
                        "has been stolen",
                        "had been stolen",
                        "was stolen"
                    ]
                },
                {
                    "id": 3,
                    "content": "The decision ___ until the next meeting.",
                    "correctIndex": 1,
                    "answers": [
                        "will not made",
                        "will not be made",
                        "has not been made"
                    ]
                },
                {
                    "id": 4,
                    "content": "Jim ___ his key.",
                    "correctIndex": 0,
                    "answers": [
                        "has lost",
                        "has been lost",
                        "was lost"
                    ]
                },
                {
                    "id": 5,
                    "content": "The room ___ later.",
                    "correctIndex": 2,
                    "answers": [
                        "has been cleaned",
                        "will clean",
                        "will be cleaned"
                    ]
                },
                {
                    "id": 6,
                    "content": "When the manager arrived, the problem ___.",
                    "correctIndex": 0,
                    "answers": [
                        "had already been solved",
                        "had solved",
                        "had already solved"
                    ]
                },
                {
                    "id": 7,
                    "content": "A new book ___ by that company next year.",
                    "correctIndex": 1,
                    "answers": [
                        "is publishing",
                        "will be published",
                        "will publish"
                    ]
                },
                {
                    "id": 8,
                    "content": "The five great lakes of the world ___ in Michigan.",
                    "correctIndex": 2,
                    "answers": [
                        "can found",
                        "can find",
                        "can be found"
                    ]
                },
                {
                    "id": 9,
                    "content": "A prize ___ to whoever solves this equation.",
                    "correctIndex": 0,
                    "answers": [
                        "will be given",
                        "will be giving",
                        "gives"
                    ]
                }
            ]
        }
    },
    {
        "id": 3,
        "category": "Modal verbs",
        "content": {
            "id": 0,
            "image": "books",
            "description": "Модальные глаголы в английском языке",
            "lessons": [
                {
                    "id": 0,
                    "title": "Modal verbs",
                    "explanation": "Модальные глаголы в английском языке отличаются от остальных глаголов тем, что они не используются самостоятельно и не обозначают конкретного действия или состояния, они отражают его модальность, то есть отношение к нему говорящего. Вместе модальный глагол и инфинитив значащего глагола образуют составное модальное сказуемое:\n\nI can play volleyball.\nЯ умею играть в волейбол.\n\nО каком именно отношении идет речь? Например, говорящий может оценивать действие как возможное, необходимое, запрещенное, маловероятное, очень вероятное и т.д.:\n\nI will go to London.\nЯ поеду в Лондон.\nI can go to London.\nЯ могу поехать в Лондон.\nI have to go to London.\nЯ должен поехать в Лондон.\nCan I go to London?\nМожно я поеду в Лондон?\n\nВ зависимости от такой оценки и структуры предложения нужно использовать один из следующих английских модальных глаголов:\n\nCan / Could, May / Might, Must, Have to / Have got to, Need, Ought to, Should, Would, Shall, Will, Dare, Used to\n\nЧаще всего используются первые три: Can, May и Must. Эти глаголы имеют самое общее значение и иногда могут заменять собой остальные модальные глаголы.\n\nВопросительные предложения с модальными глаголами образуются без вспомогательного глагола to do, при этом модальный глагол выносится в начало предложения:\n\nMay I come in?\nМожно мне войти?\nCould you give me his address?\nНе дадите мне его адрес?\n\nОтрицательная форма модального глагола образуется постановкой после него частицы not. Зачастую, особенно в устной речи, они сливаются в сокращенную форму\nТакже надо запомнить, что после модальных глаголов, кроме глаголов ought to, have (got) to и be to, следует инфинитив без частицы to:\n\nI must go.\nЯ должен идти."
                },
                {
                    "id": 1,
                    "title": "Can",
                    "explanation": "Модальный глагол Can, как и почти все модальные глаголы, является недостаточным глаголом, то есть не имеет всех обычных для глагола форм. Он используется только в двух формах: can – для употребления в настоящем времени и could – в прошедшем времени и сослагательном наклонении.\n\nПримечание:\nВ третьем лице единственного числа к Can и другим недостаточным глаголам не прибавляется окончание –s:\n\nHe can write poetry.\nОн умеет писать стихи.\n\nИз-за того, что глагол Can не имеет формы будущего времени, для описания действия в будущем он заменяется на “be able to”:\n\nSoon I will be able to read German books without a dictionary.\nСкоро я смогу читать книги на немецком без словаря.\n\nМодальный глагол Can употребляется:\n\nДля отражения физической или умственной способности, умения что-то сделать:\n\nI cannot run so fast!\nЯ не могу бежать так быстро!\nDennis could play piano since he was 13.\nДенис умел играть на пианино с 13 лет.\nI cannot drive a car.\nЯ не умею водить машину.\n\nДля обозначения общей или теоретической возможности:\n\nHe can be anywhere right now.\nОн сейчас может быть где угодно.\nYou can find any kind of information on the Internet.\nВ Интернете можно найти любую информацию.\n\nДля того, чтобы попросить/дать разрешение:\n\nCan I try on that coat?\nМожно я примерю то пальто?\nYou can come in.\nЗаходите.\n\nДля запрещения чего-либо (в отрицательной форме cannot / can’t):\n\nYou cannot walk on the grass.\nНельзя ходить по газону.\nOne cannot smoke on gas station.\nНа заправке курить запрещено.\n\nПри просьбе:\n\nCan I have a glass of water?\nМожно мне стакан воды?\nCan you wait for me in the hall?\nНе подождете меня в холле?\n\nФорма could отражает при этом подчеркнуто вежливый тон: \n\nCould you speak louder, please?\nПожалуйста, не могли бы Вы говорить погромче?"
                },
                {
                    "id": 2,
                    "title": "May",
                    "explanation": "Модальный глагол May имеет основное значение вероятности или разрешения и используется только в двух формах: may – для использования в настоящем времени и might – в прошедшем времени и сослагательном наклонении.\n\nМодальный глагол May употребляется:\n\nДля того, чтобы попросить или дать разрешение, причем такая фраза звучит более формально, чем с модальным глаголом Can:\n\nYou may leave.\nВы можете идти.\nMay I use your phone?\nМожно я воспользуюсь вашим телефоном?\n\nФорма May используется в особо вежливых просьбах.\n\nДля выражения предположения или возможности, в которых говорящий не уверен:\n\nPeter may come today.\nМожет быть, сегодня придет Питер.\nI may spend my holidays in Spain.\nМожет быть, я проведу свои каникулы в Испании.\n\nФорма Might выражает еще большую степень неуверенности:\n\nThe weather might be better tomorrow.\nМожет, завтра погода улучшится.\n\nПри запрете (в отрицательной форме):\n\nYou may not talk loudly in libraries.\nВ библиотеках нельзя громко разговаривать.\n\nОднако, как правило, значение запрета чаще выражается другими глаголами – mustn’t, can’t, don’t.\n\nВ упреке:\n\nYou might have carried my suitcase.\nМог бы и отнести мой чемодан."
                },
                {
                    "id": 3,
                    "title": "Must",
                    "explanation": "Модальный глагол Must употребляется для выражения необходимости совершения действия в силу определенных обстоятельств, а также для выражения приказания или совета.\n\nМодальный глагол Must употребляется:\n\nДля выражения непосредственной необходимости или обязанности:\n\nI must make sure cargo reaches it’s destination.\nЯ обязан следить за тем, чтобы груз достигал места своего назначения.\nWe must build this house by autumn.\nМы должны построить этот дом до осени.\n\nПри использовании во втором лице модальный глагол Must означает прямой приказ:\n\nYou must prepare the monthly sales report.\nПодготовьте ежемесячный отчет по продажам.\n\nПри запрете:\n\nYou must not use computer for more than 6 hours straight.\nНельзя сидеть за компьютером больше 6 часов подряд.\n\nДля выражения уверенности, высокой вероятности (переводится на русский язык как «должно быть»):\n\nHe must be on his way here.\nДолжно быть он уже едет сюда.\n\nЕсли модальный глагол Must в значении уверенности должен быть в отрицательной или вопросительной форме, для этого нужно использовать отрицательные частицы:\n\nHe must have never been abroad.\nДолжно быть, он никогда не бывал за рубежом."
                }
            ]
        },
        "test": {
            "id": 0,
            "questions": [
                {
                    "id": 0,
                    "content": "We've got plenty of time. We ___ to hurry.",
                    "correctIndex": 0,
                    "answers": [
                        "don't need",
                        "shouldn't",
                        "mustn't"
                    ]
                },
                {
                    "id": 1,
                    "content": "You've been reading all day. You ___ be tired.",
                    "correctIndex": 0,
                    "answers": [
                        "must",
                        "can",
                        "could"
                    ]
                },
                {
                    "id": 2,
                    "content": "I ___ to sleep recently.",
                    "correctIndex": 2,
                    "answers": [
                        "can't",
                        "mustn't",
                        "haven't been able"
                    ]
                },
                {
                    "id": 3,
                    "content": "She ___ help you tomorrow.",
                    "correctIndex": 1,
                    "answers": [
                        "is able to",
                        "will be able to",
                        "will can"
                    ]
                },
                {
                    "id": 4,
                    "content": "___ you help me carry this downstairs?",
                    "correctIndex": 0,
                    "answers": [
                        "Could",
                        "Must",
                        "Should"
                    ]
                }
            ]
        }
    }
]

