[
    {
        "id": 0,
        "category": "Swift",
        "content": {
            "id": 0,
            "image": "timer",
            "description": "Understand the fundamentals of the Swift programming language.",
            "lessons": [
                {
                    "id": 0,
                    "title": "Constants and Variables",
                    "explanation": "<div class='section' id='the-basics'><p>Constants and variables must be declared before they're used. You declare constants with the let keyword and variables with the var keyword. Here's an example of how constants and variables can be used to track the number of login attempts a user has made:</p><div class='highlight-swift notranslate'><div class='code-sample'><div class='Swift highlight'><ol class='code-lines'><li><span class='k'>let</span> <span class='nv'>maximumNumberOfLoginAttempts</span> = <span class='m'>10</span></li><li><span class='k'>var</span> <span class='nv'>currentLoginAttempt</span> = <span class='m'>0</span> </li></ol></div></div></div></div><p>You can provide a type annotation when you declare a constant or variable, to be clear about the kind of values the constant or variable can store. Write a type annotation by placing a colon after the constant or variable name, followed by a space, followed by the name of the type to use.</p><div class='highlight-swift notranslate'><div class='code-sample'><div class='Swift highlight'><ol class='code-lines'><li><span class='k'>var</span> <span class='nv'>welcomeMessage</span>: <span class='nc'>String</span></li></ol></div></div></div><p>Constant and variable names can contain almost any character, including Unicode characters. Constant and variable names can't contain whitespace characters, mathematical symbols, arrows, private-use Unicode scalar values, or line- and box-drawing characters. Nor can they begin with a number, although numbers may be included elsewhere within the name. Once you've declared a constant or variable of a certain type, you can't declare it again with the same name, or change it to store values of a different type. Nor can you change a constant into a variable or a variable into a constant.</p>"
                }
            ]
        }
    }
]
        
